In [1]:
import pandas as pd

In [11]:
data_frame=pd.read_csv("C:\\Pandas\\friend_list.csv")
data_frame

   name   age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45     manage
5  Chris   25     intern

In [12]:
data_frame=pd.read_csv("C:\\Pandas\\friend_list.csv")
data_frame

   name   age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45     manage
5  Chris   25     intern

In [13]:
data_frame.head()

   name   age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45     manage

In [14]:
data_frame.tail()

   name   age        job
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45     manage
5  Chris   25     intern

In [18]:
data_frame.head()

   name   age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45     manage

In [19]:
type(data_frame)

pandas.core.frame.DataFrame

In [20]:
data(data_frame(job))

NameError: name 'data' is not defined

In [21]:
type(data_frame('job'))

TypeError: 'DataFrame' object is not callable

In [22]:
type(data_frame.job)

pandas.core.series.Series

In [23]:
type(data_frame.age)

pandas.core.series.Series

In [25]:
type(data_frame.name)

AttributeError: 'DataFrame' object has no attribute 'name'

In [26]:
type(data_frame)

pandas.core.frame.DataFrame

In [27]:
data_frame.head(1)

  name   age      job
0  John   20  student

In [28]:
data_frame.head(0)

Empty DataFrame
Columns: [name , age, job]
Index: []

In [29]:
data_frame.tail(3)

   name   age      job
3  Julia   40  dentist
4  Brian   45   manage
5  Chris   25   intern

In [36]:
data_frame.job=data_frame.job.str.upper()
data_frame

AttributeError: 'function' object has no attribute 'job'

In [37]:
data_frame.job = data_frame.job.str.upper()
data_frame.head()

AttributeError: 'function' object has no attribute 'job'

In [38]:
df=pd.read.csv(C:\\Pandas\\friend_list.csv)

SyntaxError: invalid syntax (<ipython-input-38-727c0560be9e>, line 1)

In [39]:
df=pd.read.csv("C:\\Pandas\\friend_list.csv")

AttributeError: module 'pandas' has no attribute 'read'

In [43]:
df=pd.read_csv("C:\\Pandas\\friend_list.csv")
df

   name   age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45     manage
5  Chris   25     intern

In [44]:
df=pd.read.csv("C:\\Pandas\\friend_list.txt")

AttributeError: module 'pandas' has no attribute 'read'

In [45]:
df=pd.read_csv("C:\\Pandas\\friend_list.txt")

In [46]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [49]:
df=pd.read_csv("C:\\Pandas\\friend_list_tab.txt")
df

         name\tage\tjob
0     John\t20\tstudent
1  Jenny\t30\tdeveloper
2     Nate\t30\tteacher
3    Julia\t40\tdentist
4    Brian\t45\tmanager
5     Chris\t25\tintern

In [50]:
df=pd.read_csv("C:\\Pandas\\friend_list_tab.txt",delimiter="\t")

In [51]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [52]:
df=pd.read_csv("C:\\Pandas\\friend_list_no_head.csv")

In [53]:
df

    John  20    student
0  Jenny  30  developer
1   Nate  30    teacher
2  Julia  40    dentist
3  Brian  45     manage
4  Chris  25     intern

In [57]:
df=pd.read_csv("C:\\Pandas\\friend_list_no_head.csv",header=None)

In [58]:
df

       0   1          2
0   John  20    student
1  Jenny  30  developer
2   Nate  30    teacher
3  Julia  40    dentist
4  Brian  45     manage
5  Chris  25     intern

In [60]:
df.columns=['name','age','job']
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45     manage
5  Chris   25     intern

In [61]:
df=pd.read_csv("C:\\Pandas\\friend_list_no_head.csv")
df

    John  20    student
0  Jenny  30  developer
1   Nate  30    teacher
2  Julia  40    dentist
3  Brian  45     manage
4  Chris  25     intern

In [62]:
df.columns=['name','age','job']
df

    name  age        job
0  Jenny   30  developer
1   Nate   30    teacher
2  Julia   40    dentist
3  Brian   45     manage
4  Chris   25     intern

In [63]:
df=pd.read_csv("C:\\Pandas\\friend_list_no_head.csv",header=None,names=['name','age','job'])

In [64]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45     manage
5  Chris   25     intern

In [70]:
df=pd.read_csv("C:\\Pandas\\friend_list_no_head.csv",names=['name'])
df

               name
John  20    student
Jenny 30  developer
Nate  30    teacher
Julia 40    dentist
Brian 45     manage
Chris 25     intern